using LawyerServices.Data.Models;

namespace LawyerServices.Data.Seeding
{
    internal class CountryAndTownsSeeder : ISeeder
    {
        public async Task SeedAsync(ApplicationDbContext dbContext, IServiceProvider serviceProvider)
        {

            if (dbContext.Countries.Any())
            {
                return;
            }

            var country = new Country() { Id = Guid.NewGuid().ToString(), Name = "България" };
            var towns = new List<string>()
            {
                "Айтос","Ардино","Асеновград","Балчик","Белоградчик","Берковица","Благоевград","Ботевград","Брезник","Бургас","Бяла","Бяла Слатина",
                "Варна","Велики Преслав","Велико Търново","Велинград","Видин","Враца","Габрово","Горна Оряховица",
                "Гоце Делчев","Гълъбово","Девин","Девня","Димитровград","Добрич","Дряново","Дулово","Дупница","Елена","Елин Пелин","Елхово","Етрополе",
                "Златоград","Ивайловград","Исперих","Ихтиман","Каварна","Казанлък","Карлово","Карнобат","Кнежа","Козлодуй","Костинброд","Котел","Крумовград","Кубрат","Кула","Кърджали",
                "Кюстендил","Левски","Ловеч","Лом","Луковит","Мадан","Малко Търново","Мездра","Момчилград","Монтана","Несебър","Никопол","Нова Загора","Нови пазар","Омуртаг","Оряхово","Павликени",
                "Пазарджик","Панагюрище","Перник","Петрич","Пещера","Пирдоп","Плевен","Пловдив","Поморие","Попово","Провадия","Първомай","Раднево",
                "Радомир","Разград","Разлог","Русе","Самоков","Сандански","Свиленград","Свищов","Своге","Севлиево","Силистра","Сливен","Сливница","Смолян","София","Средец",
                "Стара Загора","Тервел","Тетевен","Тополовград","Троян","Трън","Трявна","Тутракан","Търговище","Харманли","Хасково","Царево","Чепеларе","Червен бряг","Чирпан","Шумен","Ямбол"
            };

            foreach (var town in towns)
            {
                country.Towns.Add(new Town { Id = Guid.NewGuid().ToString(), Name = town });
            }

            dbContext.Countries.Add(country);
        }
    }
}
